import * as S from "../answer.styles";
import AnswerWriter from "../write/answerWriter";

export default function AnswerList() {
  return (
    <>
      <S.AnswerBox>
        <AnswerWriter />
        <S.User>
          <img src="/img_user.jpeg" alt="유저 이미지" />
          <S.UserInfo>
            김빵빵<span>2022.11.03</span>
          </S.UserInfo>
        </S.User>
        <S.Contents>
          답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변답변
        </S.Contents>
        <S.Answer>
          <p>수정</p>
          <p>삭제</p>
        </S.Answer>
      </S.AnswerBox>
    </>
  );
}
